apps/contributions/tests/fixtures/charge-succeeded-event.json

{
    "id": "evt_fakefake",
    "object": "event",
    "account": "acct_fakefake",
    "api_version": "2020-08-27",
    "created": 1718641423,
    "data": {
        "object": {
            "id": "ch_fakefake",
            "object": "charge",
            "amount": 12000,
            "amount_captured": 0,
            "amount_refunded": 0,
            "application": "ca_fakefake",
            "application_fee": null,
            "application_fee_amount": null,
            "balance_transaction": null,
            "billing_details": {
                "address": {
                    "city": "Carolina Beach",
                    "country": "US",
                    "line1": "123 Harper Avenue",
                    "line2": "",
                    "postal_code": "28428",
                    "state": "North Carolina"
                },
                "email": "foo@bar.org",
                "name": "foo bar",
                "phone": "123"
            },
            "calculated_statement_descriptor": "WWW.foo.ORG",
            "captured": false,
            "created": 1718641423,
            "currency": "usd",
            "customer": "cus_fakefake",
            "description": null,
            "destination": null,
            "dispute": null,
            "disputed": false,
            "failure_balance_transaction": null,
            "failure_code": null,
            "failure_message": null,
            "fraud_details": {},
            "invoice": null,
            "livemode": false,
            "metadata": {
                "referer": "https://www.fake.org/",
                "donor_selected_amount": "120.0",
                "revenue_program_id": "3",
                "source": "rev-engine",
                "swag_opt_out": "False",
                "agreed_to_pay_fees": "False",
                "contributor_id": "733",
                "revenue_program_slug": "fake-fake",
                "schema_version": "1.4"
            },
            "on_behalf_of": null,
            "order": null,
            "outcome": {
                "network_status": "approved_by_network",
                "reason": null,
                "risk_level": "normal",
                "risk_score": 47,
                "seller_message": "Payment complete.",
                "type": "authorized"
            },
            "paid": true,
            "payment_intent": "pi_fakefakeP",
            "payment_method": "pm_fakefake",
            "payment_method_details": {
                "card": {
                    "amount_authorized": 12000,
                    "brand": "visa",
                    "capture_before": 1719246223,
                    "checks": {
                        "address_line1_check": "pass",
                        "address_postal_code_check": "pass",
                        "cvc_check": "pass"
                    },
                    "country": "US",
                    "exp_month": 12,
                    "exp_year": 2044,
                    "extended_authorization": {
                        "status": "disabled"
                    },
                    "fingerprint": "t3Nk1zg9IfbJoyRi",
                    "funding": "credit",
                    "incremental_authorization": {
                        "status": "unavailable"
                    },
                    "installments": null,
                    "last4": "4242",
                    "mandate": null,
                    "multicapture": {
                        "status": "unavailable"
                    },
                    "network": "visa",
                    "network_token": {
                        "used": false
                    },
                    "overcapture": {
                        "maximum_amount_capturable": 12000,
                        "status": "unavailable"
                    },
                    "three_d_secure": null,
                    "wallet": null
                },
                "type": "card"
            },
            "radar_options": {},
            "receipt_email": null,
            "receipt_number": null,
            "receipt_url": "https://pay.stripe.com/receipts/payment/fakefake",
            "refunded": false,
            "refunds": {
                "object": "list",
                "data": [],
                "has_more": false,
                "total_count": 0,
                "url": "/v1/charges/ch_fakefake/refunds"
            },
            "review": null,
            "shipping": null,
            "source": null,
            "source_transfer": null,
            "statement_descriptor": null,
            "statement_descriptor_suffix": null,
            "status": "succeeded",
            "transfer_data": null,
            "transfer_group": null
        }
    },
    "livemode": false,
    "pending_webhooks": 1,
    "request": {
        "id": "req_fakefake",
        "idempotency_key": "fake"
    },
    "type": "charge.succeeded"
}
